{"pageProps":{"filename":"web-apps-in-a-box","title":"Web Applications in a Box","date":"2020-10-26","author":"Zyrn","published":true,"content":"<p>It has been a bit over a month since my last post and I have managed to get some good progress on some new projects.</p>\n<p>Since I last made a post, I have put a few more hours into my language, but since progress was slow I decided to tackle a task which I could make quick progress in and be proud of. One the main goals for this project was to design an application using the docker ecosystem and build it entirely in docker containers. For now I will be sticking to design architectures I am more comfortable with splitting the functionality into a UI layer (Next.js w/React), Business Logic Layer (Express.js, Passport.js, etc) and a data layer (MongoDB, GraphQL, Apollo, etc) rather than trying to branch out to a more heavily micro-services based architecture.</p>\n<p>As I alluded to earlier, I was trying to quick progress on this project rather than building everything by hand, so my tech list reads a bit like current treads buzzword list.</p>\n<p><strong>Front End</strong></p>\n<ul>\n<li>Next.js</li>\n<li>React.js</li>\n<li>Apollo (GraphQL Client)</li>\n</ul>\n<p><strong>Back End</strong></p>\n<ul>\n<li>Express.js</li>\n<li>Passport.js (authentication)</li>\n<li>NodeMailer.js (mail)</li>\n<li>Mongoose.js (database client)</li>\n<li>Express-GraphQL (GraphQL server)</li>\n</ul>\n<p><strong>Data</strong></p>\n<ul>\n<li>MongoDB</li>\n<li>Apollo (client-side caching)</li>\n<li>GraphQL (schema &#x26; query design)</li>\n</ul>\n<p><strong>Management</strong></p>\n<ul>\n<li>Nginx (Web Server)</li>\n<li>Mongo Express (Database Web Client)</li>\n</ul>\n<p>This project was designed to be a base application for various purposes so as such it has a generic front-end template and the ability so simply add more data and functionality on the back-end. The database is highly flexibly too. In addition to these design choices I have added features to assist with user management, identification, authorisation and well as emailing. Furthermore, I have allowed many settings to be customised at environment to allow for a single application to be setup for many different clients with no changes to the codebase.</p>\n<p>If you are interest in seeing what I currently have check out an example page <a href=\"https://example.zyrn.dev\">here</a>. Also, you will probably here a bit more about this project in the future as I have a client for whom I will be using this framework to develop their solution. This will help me better flesh out the core features for this framework.</p>\n<p>I hope to have tons of cool stuff to share next month, so until then I will be working hard on this.</p>\n"},"__N_SSG":true}